Masmiseim36/nxpSDK/devices/MK28F15/drivers/fsl_clock.c
    return true;
}

void CLOCK_DisableUsbhs0Clock(void)
{
    USBPHY->PLL_SIC &= ~USBPHY_PLL_SIC_PLL_EN_USB_CLKS_MASK; /* Disable USB clock output from USB PHY PLL */
    SIM->SCGC3 &= ~SIM_SCGC3_USBHS_MASK;
}

bool CLOCK_EnableUsbhs0PhyPllClock(clock_usb_phy_src_t src, uint32_t freq)
{
    volatile uint32_t i;
    uint32_t phyPllDiv = 0U;

    /*
     * In order to bring up the internal 480MHz USB PLL clock, should make sure:
     * 1. 32kHz IRC clock enable by setting IRCLKEN bit in MCG_C1 register.
     * 2. External reference clock enable on XTAL by setting ERCLKEN bit in OSC_CR register.
     */
    assert(MCG->C1 & MCG_C1_IRCLKEN_MASK);
    assert(!(MCG->C2 & MCG_C2_IRCS_MASK));
    assert(OSC0->CR & OSC_CR_ERCLKEN_MASK);

    if (24000000U == freq)
    {
        phyPllDiv = USBPHY_PLL_SIC_PLL_DIV_SEL(0U);
    }
    else if (16000000U == freq)
    {
        phyPllDiv = USBPHY_PLL_SIC_PLL_DIV_SEL(1U);
    }
    else if (12000000U == freq)
    {
        phyPllDiv = USBPHY_PLL_SIC_PLL_DIV_SEL(2U);
    }
    else
    {
        return false;
    }

    /* Source and freq are not used for USB HS. */
    src = src;

    SIM->SCGC3 |= SIM_SCGC3_USBHSPHY_MASK;
    SIM->SOPT2 |= SIM_SOPT2_USBREGEN_MASK;

    i = 500000U;
    while (i--)
    {
        __NOP();
    }

    USBPHY->TRIM_OVERRIDE_EN = 0x01U;                 /* Override the trim. */
    USBPHY->CTRL &= ~USBPHY_CTRL_SFTRST_MASK;         /* release PHY from reset */
    USBPHY->PLL_SIC |= USBPHY_PLL_SIC_PLL_POWER_MASK; /* power up PLL */
    USBPHY->PLL_SIC = (USBPHY->PLL_SIC & ~USBPHY_PLL_SIC_PLL_DIV_SEL_MASK) | phyPllDiv;
    USBPHY->PLL_SIC &= ~USBPHY_PLL_SIC_PLL_BYPASS_MASK; /* Clear bypass bit */
    USBPHY->CTRL &= ~USBPHY_CTRL_CLKGATE_MASK;          /* Clear to 0U to run clocks */

    /* Wait for lock. */
    while (!(USBPHY->PLL_SIC & USBPHY_PLL_SIC_PLL_LOCK_MASK))
    {
    }

    return true;
}

void CLOCK_DisableUsbhs0PhyPllClock(void)
{
    USBPHY->CTRL |= USBPHY_CTRL_CLKGATE_MASK;          /* Set to 1U to gate clocks */
    USBPHY->PLL_SIC &= ~USBPHY_PLL_SIC_PLL_POWER_MASK; /* Power down PLL */
    SIM->SOPT2 &= ~SIM_SOPT2_USBREGEN_MASK;
    SIM->SCGC3 &= ~SIM_SCGC3_USBHSPHY_MASK;
}

void CLOCK_EnableUsbhs0PfdClock(uint8_t frac, clock_usb_pfd_src_t src)
{
    assert((frac <= 35U) && (frac >= 18U));
    uint32_t fracFreq = (480000U * 18U / frac) * 1000U;

    USBPHY->ANACTRL = (USBPHY->ANACTRL & ~(USBPHY_ANACTRL_PFD_FRAC_MASK | USBPHY_ANACTRL_PFD_CLK_SEL_MASK)) |
                      (USBPHY_ANACTRL_PFD_FRAC(frac) | USBPHY_ANACTRL_PFD_CLK_SEL(src));

    USBPHY->ANACTRL &= ~USBPHY_ANACTRL_PFD_CLKGATE_MASK;
    while (!(USBPHY->ANACTRL & USBPHY_ANACTRL_PFD_STABLE_MASK))
    {
    }

    if (kCLOCK_UsbPfdSrcExt == src)
    {
        s_extPllFreq = g_xtal0Freq;
    }
    else if (kCLOCK_UsbPfdSrcFracDivBy4 == src)
    {
        s_extPllFreq = fracFreq / 4U;
    }
    else if (kCLOCK_UsbPfdSrcFracDivBy2 == src)
    {
        s_extPllFreq = fracFreq / 2U;
    }
    else
    {
        s_extPllFreq = fracFreq;
    }
}

void CLOCK_DisableUsbhs0PfdClock(void)
{
    USBPHY->ANACTRL |= USBPHY_ANACTRL_PFD_CLKGATE_MASK;
    s_extPllFreq = 0U;
}

uint32_t CLOCK_GetOutClkFreq(void)
{
    uint32_t mcgoutclk;
    uint32_t clkst = MCG_S_CLKST_VAL;
    uint32_t pllcst = MCG_S2_PLLCST_VAL;

    switch (clkst)
    {
        case kMCG_ClkOutStatPll:
            switch (pllcst)
            {
                case kMCG_PllClkSelExtPll:
                    mcgoutclk = CLOCK_GetExtPllFreq();
                    break;
                case kMCG_PllClkSelPll0:
                    mcgoutclk = CLOCK_GetPll0Freq();
                    break;
                default:
                    mcgoutclk = 0U;
                    break;
            }
            break;
        case kMCG_ClkOutStatFll:
            mcgoutclk = CLOCK_GetFllFreq();
            break;
        case kMCG_ClkOutStatInt:
            mcgoutclk = CLOCK_GetInternalRefClkSelectFreq();
            break;
        case kMCG_ClkOutStatExt:
            mcgoutclk = CLOCK_GetMcgExtClkFreq();
            break;
        default:
            mcgoutclk = 0U;
            break;
    }
    return mcgoutclk;
}

uint32_t CLOCK_GetFllFreq(void)
{
    static const uint16_t fllFactorTable[4][2] = {{640, 732}, {1280, 1464}, {1920, 2197}, {2560, 2929}};

    uint8_t drs, dmx32;
    uint32_t freq;

    /* If FLL is not enabled currently, then return 0U. */
    if ((MCG->C2 & MCG_C2_LP_MASK) || (MCG->S & MCG_S_PLLST_MASK))
    {
        return 0U;
    }

    /* Get FLL reference clock frequency. */
    freq = CLOCK_GetFllRefClkFreq();
    if (!freq)
    {
        return freq;
    }

    drs = MCG_C4_DRST_DRS_VAL;
    dmx32 = MCG_C4_DMX32_VAL;

    return freq * fllFactorTable[drs][dmx32];
}

uint32_t CLOCK_GetInternalRefClkFreq(void)
{
    /* If MCGIRCLK is gated. */
    if (!(MCG->C1 & MCG_C1_IRCLKEN_MASK))
    {
        return 0U;
    }

    return CLOCK_GetInternalRefClkSelectFreq();
}

uint32_t CLOCK_GetFixedFreqClkFreq(void)
{
    uint32_t freq = CLOCK_GetFllRefClkFreq();

    /* MCGFFCLK must be no more than MCGOUTCLK/8. */
    if ((freq) && (freq <= (CLOCK_GetOutClkFreq() / 8U)))
    {
        return freq;
    }
    else
    {
        return 0U;
    }
}

uint32_t CLOCK_GetPll0Freq(void)
{
    uint32_t mcgpll0clk;

    /* If PLL0 is not enabled, return 0. */
    if (!(MCG->S & MCG_S_LOCK0_MASK))
    {
        return 0U;
    }

    mcgpll0clk = CLOCK_GetPll0RefFreq();

    /*
     * Please call CLOCK_SetXtal0Freq base on board setting before using OSC0 clock.
     * Please call CLOCK_SetXtal1Freq base on board setting before using OSC1 clock.
     */
    assert(mcgpll0clk);

    mcgpll0clk /= (FSL_FEATURE_MCG_PLL_PRDIV_BASE + MCG_C5_PRDIV0_VAL);
    mcgpll0clk *= (FSL_FEATURE_MCG_PLL_VDIV_BASE + MCG_C6_VDIV0_VAL);

    mcgpll0clk >>= 1U;
    return mcgpll0clk;
}

uint32_t CLOCK_GetExtPllFreq(void)
{
    return s_extPllFreq;
}

void CLOCK_SetExtPllFreq(uint32_t freq)
{
    s_extPllFreq = freq;
}

status_t CLOCK_SetExternalRefClkConfig(mcg_oscsel_t oscsel)
{
    bool needDelay;
    uint32_t i;

#if (defined(MCG_CONFIG_CHECK_PARAM) && MCG_CONFIG_CHECK_PARAM)
    /* If change MCG_C7[OSCSEL] and external reference clock is system clock source, return error. */
    if ((MCG_C7_OSCSEL_VAL != oscsel) && (!(MCG->S & MCG_S_IREFST_MASK)))
    {
        return kStatus_MCG_SourceUsed;
    }
#endif /* MCG_CONFIG_CHECK_PARAM */

